SabicAlija/Plant-Irrigation-System/API/QVGA Touchscreen/Kentec320x240x16_touch_tm4c1294xl.c
    //
    // There is no touch screen handler initially.
    //
    g_pfnTSHandler = 0;

    //
    // Enable the peripherals used by the touch screen interface.
    //
    SysCtlPeripheralEnable(SYSCTL_PERIPH_ADC0);
    SysCtlPeripheralEnable(TS_P_XP_PERIPH);
    SysCtlPeripheralEnable(TS_P_YP_PERIPH);
    SysCtlPeripheralEnable(TS_P_XN_PERIPH);
    SysCtlPeripheralEnable(TS_P_YN_PERIPH);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_TIMER2);

    //
    // Configure the ADC sample sequence used to read the touch screen reading.
    //
    ADCHardwareOversampleConfigure(ADC0_BASE, 16);
    ADCSequenceConfigure(ADC0_BASE, 3, ADC_TRIGGER_TIMER, 0);
    ADCSequenceStepConfigure(ADC0_BASE, 3, 0,
                             TS_YP_ADC | ADC_CTL_END | ADC_CTL_IE |
                             ADC_CTL_SHOLD_256);
    ADCSequenceEnable(ADC0_BASE, 3);

    //
    // Enable the ADC sample sequence interrupt.
    //
    ADCIntEnable(ADC0_BASE, 3);
    IntEnable(INT_ADC0SS3);

    //
    // Configure the GPIOs used to drive the touch screen layers.
    //
    GPIOPinTypeGPIOOutput(TS_P_YP_BASE, TS_XP_PIN | TS_YP_PIN);
    GPIOPinTypeGPIOOutput(TS_P_XN_BASE, TS_XN_PIN);
    GPIOPinTypeGPIOOutput(TS_P_YN_BASE, TS_YN_PIN);

    GPIOPinWrite(TS_P_YP_BASE, TS_XP_PIN | TS_YP_PIN, 0x00);
    GPIOPinWrite(TS_P_XN_BASE, TS_XN_PIN, 0x00);
    GPIOPinWrite(TS_P_YN_BASE, TS_YN_PIN, 0x00);

    //
    // See if the ADC trigger timer has been configured, and configure it only
    // if it has not been configured yet.
    //
    if((HWREG(TIMER2_BASE + TIMER_O_CTL) & TIMER_CTL_TAEN) == 0)
    {
        //
        // Configure the timer to trigger the sampling of the touch screen
        // every millisecond.
        //
        TimerConfigure(TIMER2_BASE, (TIMER_CFG_SPLIT_PAIR |
                                     TIMER_CFG_A_PERIODIC |
                                     TIMER_CFG_B_PERIODIC));
        TimerLoadSet(TIMER2_BASE, TIMER_A, (ui32SysClock / 400) - 1);
        TimerControlTrigger(TIMER2_BASE, TIMER_A, true);

        //
        // Enable the timer.  At this point, the touch screen state machine
        // will sample and run once per millisecond.
        //
        TimerEnable(TIMER2_BASE, TIMER_A);
    }
}

//*****************************************************************************
//
//! Sets the callback function for touch screen events.
//!
//! \param pfnCallback is a pointer to the function to be called when touch
//! screen events occur.
//!
//! This function sets the address of the function to be called when touch
//! screen events occur.  The events that are recognized are the screen being
//! touched (``pen down''), the touch position moving while the screen is
//! touched (``pen move''), and the screen no longer being touched (``pen
//! up'').
//!
//! \return None.
//
//*****************************************************************************
void
TouchScreenCallbackSet(int32_t (*pfnCallback)(uint32_t ui32Message,
                                              int32_t i32X, int32_t i32Y))
{
    //
    // Save the pointer to the callback function.
    //
    g_pfnTSHandler = pfnCallback;
}
